espressif/esp-idf/components/soc/esp32s31/register/soc/ahb_dma_reg.h
/** AHB_DMA_IN_INT_ENA_CH2_REG register
 *  Interrupt enable bits of RX channel 2
 */
#define AHB_DMA_IN_INT_ENA_CH2_REG (DR_REG_AHB_DMA_BASE + 0x28)
/** AHB_DMA_IN_DONE_CH2_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_DONE_CH2_INT.
 */
#define AHB_DMA_IN_DONE_CH2_INT_ENA    (BIT(0))
#define AHB_DMA_IN_DONE_CH2_INT_ENA_M  (AHB_DMA_IN_DONE_CH2_INT_ENA_V << AHB_DMA_IN_DONE_CH2_INT_ENA_S)
#define AHB_DMA_IN_DONE_CH2_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_DONE_CH2_INT_ENA_S  0
/** AHB_DMA_IN_SUC_EOF_CH2_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_SUC_EOF_CH2_INT.
 */
#define AHB_DMA_IN_SUC_EOF_CH2_INT_ENA    (BIT(1))
#define AHB_DMA_IN_SUC_EOF_CH2_INT_ENA_M  (AHB_DMA_IN_SUC_EOF_CH2_INT_ENA_V << AHB_DMA_IN_SUC_EOF_CH2_INT_ENA_S)
#define AHB_DMA_IN_SUC_EOF_CH2_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_SUC_EOF_CH2_INT_ENA_S  1
/** AHB_DMA_IN_ERR_EOF_CH2_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_ERR_EOF_CH2_INT.
 */
#define AHB_DMA_IN_ERR_EOF_CH2_INT_ENA    (BIT(2))
#define AHB_DMA_IN_ERR_EOF_CH2_INT_ENA_M  (AHB_DMA_IN_ERR_EOF_CH2_INT_ENA_V << AHB_DMA_IN_ERR_EOF_CH2_INT_ENA_S)
#define AHB_DMA_IN_ERR_EOF_CH2_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_ERR_EOF_CH2_INT_ENA_S  2
/** AHB_DMA_IN_DSCR_ERR_CH2_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH2_INT.
 */
#define AHB_DMA_IN_DSCR_ERR_CH2_INT_ENA    (BIT(3))
#define AHB_DMA_IN_DSCR_ERR_CH2_INT_ENA_M  (AHB_DMA_IN_DSCR_ERR_CH2_INT_ENA_V << AHB_DMA_IN_DSCR_ERR_CH2_INT_ENA_S)
#define AHB_DMA_IN_DSCR_ERR_CH2_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_DSCR_ERR_CH2_INT_ENA_S  3
/** AHB_DMA_IN_DSCR_EMPTY_CH2_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH2_INT.
 */
#define AHB_DMA_IN_DSCR_EMPTY_CH2_INT_ENA    (BIT(4))
#define AHB_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_M  (AHB_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_V << AHB_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_S)
#define AHB_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_DSCR_EMPTY_CH2_INT_ENA_S  4
/** AHB_DMA_INFIFO_OVF_CH2_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to enable AHB_DMA_INFIFO_OVF_CH2_INT.
 */
#define AHB_DMA_INFIFO_OVF_CH2_INT_ENA    (BIT(5))
#define AHB_DMA_INFIFO_OVF_CH2_INT_ENA_M  (AHB_DMA_INFIFO_OVF_CH2_INT_ENA_V << AHB_DMA_INFIFO_OVF_CH2_INT_ENA_S)
#define AHB_DMA_INFIFO_OVF_CH2_INT_ENA_V  0x00000001U
#define AHB_DMA_INFIFO_OVF_CH2_INT_ENA_S  5
/** AHB_DMA_INFIFO_UDF_CH2_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Write 1 to enable AHB_DMA_INFIFO_UDF_CH2_INT.
 */
#define AHB_DMA_INFIFO_UDF_CH2_INT_ENA    (BIT(6))
#define AHB_DMA_INFIFO_UDF_CH2_INT_ENA_M  (AHB_DMA_INFIFO_UDF_CH2_INT_ENA_V << AHB_DMA_INFIFO_UDF_CH2_INT_ENA_S)
#define AHB_DMA_INFIFO_UDF_CH2_INT_ENA_V  0x00000001U
#define AHB_DMA_INFIFO_UDF_CH2_INT_ENA_S  6
/** AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_RESP_ERR_CH2_INT.
 */
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_ENA    (BIT(7))
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_ENA_M  (AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_ENA_V << AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_ENA_S)
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_ENA_S  7

/** AHB_DMA_IN_INT_CLR_CH2_REG register
 *  Interrupt clear bits of RX channel 2
 */
#define AHB_DMA_IN_INT_CLR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x2c)
/** AHB_DMA_IN_DONE_CH2_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Write 1 to clear AHB_DMA_IN_DONE_CH2_INT.
 */
#define AHB_DMA_IN_DONE_CH2_INT_CLR    (BIT(0))
#define AHB_DMA_IN_DONE_CH2_INT_CLR_M  (AHB_DMA_IN_DONE_CH2_INT_CLR_V << AHB_DMA_IN_DONE_CH2_INT_CLR_S)
#define AHB_DMA_IN_DONE_CH2_INT_CLR_V  0x00000001U
#define AHB_DMA_IN_DONE_CH2_INT_CLR_S  0
/** AHB_DMA_IN_SUC_EOF_CH2_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Write 1 to clear AHB_DMA_IN_SUC_EOF_CH2_INT.
 */
#define AHB_DMA_IN_SUC_EOF_CH2_INT_CLR    (BIT(1))
#define AHB_DMA_IN_SUC_EOF_CH2_INT_CLR_M  (AHB_DMA_IN_SUC_EOF_CH2_INT_CLR_V << AHB_DMA_IN_SUC_EOF_CH2_INT_CLR_S)
#define AHB_DMA_IN_SUC_EOF_CH2_INT_CLR_V  0x00000001U
#define AHB_DMA_IN_SUC_EOF_CH2_INT_CLR_S  1
/** AHB_DMA_IN_ERR_EOF_CH2_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Write 1 to clear AHB_DMA_IN_ERR_EOF_CH2_INT.
 */
#define AHB_DMA_IN_ERR_EOF_CH2_INT_CLR    (BIT(2))
#define AHB_DMA_IN_ERR_EOF_CH2_INT_CLR_M  (AHB_DMA_IN_ERR_EOF_CH2_INT_CLR_V << AHB_DMA_IN_ERR_EOF_CH2_INT_CLR_S)
#define AHB_DMA_IN_ERR_EOF_CH2_INT_CLR_V  0x00000001U
#define AHB_DMA_IN_ERR_EOF_CH2_INT_CLR_S  2
/** AHB_DMA_IN_DSCR_ERR_CH2_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear AHB_DMA_IN_DSCR_ERR_CH2_INT.
 */
#define AHB_DMA_IN_DSCR_ERR_CH2_INT_CLR    (BIT(3))
#define AHB_DMA_IN_DSCR_ERR_CH2_INT_CLR_M  (AHB_DMA_IN_DSCR_ERR_CH2_INT_CLR_V << AHB_DMA_IN_DSCR_ERR_CH2_INT_CLR_S)
#define AHB_DMA_IN_DSCR_ERR_CH2_INT_CLR_V  0x00000001U
#define AHB_DMA_IN_DSCR_ERR_CH2_INT_CLR_S  3
/** AHB_DMA_IN_DSCR_EMPTY_CH2_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Write 1 to clear AHB_DMA_IN_DSCR_EMPTY_CH2_INT.
 */
#define AHB_DMA_IN_DSCR_EMPTY_CH2_INT_CLR    (BIT(4))
#define AHB_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_M  (AHB_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_V << AHB_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_S)
#define AHB_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_V  0x00000001U
#define AHB_DMA_IN_DSCR_EMPTY_CH2_INT_CLR_S  4
/** AHB_DMA_INFIFO_OVF_CH2_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear AHB_DMA_INFIFO_OVF_CH2_INT.
 */
#define AHB_DMA_INFIFO_OVF_CH2_INT_CLR    (BIT(5))
#define AHB_DMA_INFIFO_OVF_CH2_INT_CLR_M  (AHB_DMA_INFIFO_OVF_CH2_INT_CLR_V << AHB_DMA_INFIFO_OVF_CH2_INT_CLR_S)
#define AHB_DMA_INFIFO_OVF_CH2_INT_CLR_V  0x00000001U
#define AHB_DMA_INFIFO_OVF_CH2_INT_CLR_S  5
/** AHB_DMA_INFIFO_UDF_CH2_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Write 1 to clear AHB_DMA_INFIFO_UDF_CH2_INT.
 */
#define AHB_DMA_INFIFO_UDF_CH2_INT_CLR    (BIT(6))
#define AHB_DMA_INFIFO_UDF_CH2_INT_CLR_M  (AHB_DMA_INFIFO_UDF_CH2_INT_CLR_V << AHB_DMA_INFIFO_UDF_CH2_INT_CLR_S)
#define AHB_DMA_INFIFO_UDF_CH2_INT_CLR_V  0x00000001U
#define AHB_DMA_INFIFO_UDF_CH2_INT_CLR_S  6
/** AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Write 1 to clear AHB_DMA_IN_RESP_ERR_CH2_INT.
 */
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_CLR    (BIT(7))
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_CLR_M  (AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_CLR_V << AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_CLR_S)
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_CLR_V  0x00000001U
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH2_INT_CLR_S  7

/** AHB_DMA_IN_INT_RAW_CH3_REG register
 *  Raw interrupt status of RX channel 3
 */
#define AHB_DMA_IN_INT_RAW_CH3_REG (DR_REG_AHB_DMA_BASE + 0x30)
/** AHB_DMA_IN_DONE_CH3_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt status of AHB_DMA_IN_DONE_CH3_INT.
 */
#define AHB_DMA_IN_DONE_CH3_INT_RAW    (BIT(0))
#define AHB_DMA_IN_DONE_CH3_INT_RAW_M  (AHB_DMA_IN_DONE_CH3_INT_RAW_V << AHB_DMA_IN_DONE_CH3_INT_RAW_S)
#define AHB_DMA_IN_DONE_CH3_INT_RAW_V  0x00000001U
#define AHB_DMA_IN_DONE_CH3_INT_RAW_S  0
/** AHB_DMA_IN_SUC_EOF_CH3_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt status of AHB_DMA_IN_SUC_EOF_CH3_INT.
 */
#define AHB_DMA_IN_SUC_EOF_CH3_INT_RAW    (BIT(1))
#define AHB_DMA_IN_SUC_EOF_CH3_INT_RAW_M  (AHB_DMA_IN_SUC_EOF_CH3_INT_RAW_V << AHB_DMA_IN_SUC_EOF_CH3_INT_RAW_S)
#define AHB_DMA_IN_SUC_EOF_CH3_INT_RAW_V  0x00000001U
#define AHB_DMA_IN_SUC_EOF_CH3_INT_RAW_S  1
/** AHB_DMA_IN_ERR_EOF_CH3_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt status of AHB_DMA_IN_ERR_EOF_CH3_INT.
 */
#define AHB_DMA_IN_ERR_EOF_CH3_INT_RAW    (BIT(2))
#define AHB_DMA_IN_ERR_EOF_CH3_INT_RAW_M  (AHB_DMA_IN_ERR_EOF_CH3_INT_RAW_V << AHB_DMA_IN_ERR_EOF_CH3_INT_RAW_S)
#define AHB_DMA_IN_ERR_EOF_CH3_INT_RAW_V  0x00000001U
#define AHB_DMA_IN_ERR_EOF_CH3_INT_RAW_S  2
/** AHB_DMA_IN_DSCR_ERR_CH3_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt status of AHB_DMA_IN_DSCR_ERR_CH3_INT.
 */
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_RAW    (BIT(3))
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_RAW_M  (AHB_DMA_IN_DSCR_ERR_CH3_INT_RAW_V << AHB_DMA_IN_DSCR_ERR_CH3_INT_RAW_S)
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_RAW_V  0x00000001U
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_RAW_S  3
/** AHB_DMA_IN_DSCR_EMPTY_CH3_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH3_INT.
 */
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_RAW    (BIT(4))
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_M  (AHB_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_V << AHB_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_S)
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_V  0x00000001U
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_RAW_S  4
/** AHB_DMA_INFIFO_OVF_CH3_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt status of AHB_DMA_INFIFO_OVF_CH3_INT.
 */
#define AHB_DMA_INFIFO_OVF_CH3_INT_RAW    (BIT(5))
#define AHB_DMA_INFIFO_OVF_CH3_INT_RAW_M  (AHB_DMA_INFIFO_OVF_CH3_INT_RAW_V << AHB_DMA_INFIFO_OVF_CH3_INT_RAW_S)
#define AHB_DMA_INFIFO_OVF_CH3_INT_RAW_V  0x00000001U
#define AHB_DMA_INFIFO_OVF_CH3_INT_RAW_S  5
/** AHB_DMA_INFIFO_UDF_CH3_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt status of AHB_DMA_INFIFO_UDF_CH3_INT.
 */
#define AHB_DMA_INFIFO_UDF_CH3_INT_RAW    (BIT(6))
#define AHB_DMA_INFIFO_UDF_CH3_INT_RAW_M  (AHB_DMA_INFIFO_UDF_CH3_INT_RAW_V << AHB_DMA_INFIFO_UDF_CH3_INT_RAW_S)
#define AHB_DMA_INFIFO_UDF_CH3_INT_RAW_V  0x00000001U
#define AHB_DMA_INFIFO_UDF_CH3_INT_RAW_S  6
/** AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt status of AHB_DMA_IN_RESP_ERR_CH3_INT.
 */
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_RAW    (BIT(7))
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_RAW_M  (AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_RAW_V << AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_RAW_S)
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_RAW_V  0x00000001U
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_RAW_S  7

/** AHB_DMA_IN_INT_ST_CH3_REG register
 *  Masked interrupt status of RX channel 3
 */
#define AHB_DMA_IN_INT_ST_CH3_REG (DR_REG_AHB_DMA_BASE + 0x34)
/** AHB_DMA_IN_DONE_CH3_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status of AHB_DMA_IN_DONE_CH3_INT.
 */
#define AHB_DMA_IN_DONE_CH3_INT_ST    (BIT(0))
#define AHB_DMA_IN_DONE_CH3_INT_ST_M  (AHB_DMA_IN_DONE_CH3_INT_ST_V << AHB_DMA_IN_DONE_CH3_INT_ST_S)
#define AHB_DMA_IN_DONE_CH3_INT_ST_V  0x00000001U
#define AHB_DMA_IN_DONE_CH3_INT_ST_S  0
/** AHB_DMA_IN_SUC_EOF_CH3_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status of AHB_DMA_IN_SUC_EOF_CH3_INT.
 */
#define AHB_DMA_IN_SUC_EOF_CH3_INT_ST    (BIT(1))
#define AHB_DMA_IN_SUC_EOF_CH3_INT_ST_M  (AHB_DMA_IN_SUC_EOF_CH3_INT_ST_V << AHB_DMA_IN_SUC_EOF_CH3_INT_ST_S)
#define AHB_DMA_IN_SUC_EOF_CH3_INT_ST_V  0x00000001U
#define AHB_DMA_IN_SUC_EOF_CH3_INT_ST_S  1
/** AHB_DMA_IN_ERR_EOF_CH3_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status of AHB_DMA_IN_ERR_EOF_CH3_INT.
 */
#define AHB_DMA_IN_ERR_EOF_CH3_INT_ST    (BIT(2))
#define AHB_DMA_IN_ERR_EOF_CH3_INT_ST_M  (AHB_DMA_IN_ERR_EOF_CH3_INT_ST_V << AHB_DMA_IN_ERR_EOF_CH3_INT_ST_S)
#define AHB_DMA_IN_ERR_EOF_CH3_INT_ST_V  0x00000001U
#define AHB_DMA_IN_ERR_EOF_CH3_INT_ST_S  2
/** AHB_DMA_IN_DSCR_ERR_CH3_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status of AHB_DMA_IN_DSCR_ERR_CH3_INT.
 */
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_ST    (BIT(3))
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_ST_M  (AHB_DMA_IN_DSCR_ERR_CH3_INT_ST_V << AHB_DMA_IN_DSCR_ERR_CH3_INT_ST_S)
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_ST_V  0x00000001U
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_ST_S  3
/** AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked interrupt status of AHB_DMA_IN_DSCR_EMPTY_CH3_INT.
 */
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ST    (BIT(4))
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ST_M  (AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ST_V << AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ST_S)
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ST_V  0x00000001U
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ST_S  4
/** AHB_DMA_INFIFO_OVF_CH3_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status of AHB_DMA_INFIFO_OVF_CH3_INT.
 */
#define AHB_DMA_INFIFO_OVF_CH3_INT_ST    (BIT(5))
#define AHB_DMA_INFIFO_OVF_CH3_INT_ST_M  (AHB_DMA_INFIFO_OVF_CH3_INT_ST_V << AHB_DMA_INFIFO_OVF_CH3_INT_ST_S)
#define AHB_DMA_INFIFO_OVF_CH3_INT_ST_V  0x00000001U
#define AHB_DMA_INFIFO_OVF_CH3_INT_ST_S  5
/** AHB_DMA_INFIFO_UDF_CH3_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked interrupt status of AHB_DMA_INFIFO_UDF_CH3_INT.
 */
#define AHB_DMA_INFIFO_UDF_CH3_INT_ST    (BIT(6))
#define AHB_DMA_INFIFO_UDF_CH3_INT_ST_M  (AHB_DMA_INFIFO_UDF_CH3_INT_ST_V << AHB_DMA_INFIFO_UDF_CH3_INT_ST_S)
#define AHB_DMA_INFIFO_UDF_CH3_INT_ST_V  0x00000001U
#define AHB_DMA_INFIFO_UDF_CH3_INT_ST_S  6
/** AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ST : RO; bitpos: [7]; default: 0;
 *  The masked interrupt status of AHB_DMA_IN_RESP_ERR_CH3_INT.
 */
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ST    (BIT(7))
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ST_M  (AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ST_V << AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ST_S)
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ST_V  0x00000001U
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ST_S  7

/** AHB_DMA_IN_INT_ENA_CH3_REG register
 *  Interrupt enable bits of RX channel 3
 */
#define AHB_DMA_IN_INT_ENA_CH3_REG (DR_REG_AHB_DMA_BASE + 0x38)
/** AHB_DMA_IN_DONE_CH3_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_DONE_CH3_INT.
 */
#define AHB_DMA_IN_DONE_CH3_INT_ENA    (BIT(0))
#define AHB_DMA_IN_DONE_CH3_INT_ENA_M  (AHB_DMA_IN_DONE_CH3_INT_ENA_V << AHB_DMA_IN_DONE_CH3_INT_ENA_S)
#define AHB_DMA_IN_DONE_CH3_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_DONE_CH3_INT_ENA_S  0
/** AHB_DMA_IN_SUC_EOF_CH3_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_SUC_EOF_CH3_INT.
 */
#define AHB_DMA_IN_SUC_EOF_CH3_INT_ENA    (BIT(1))
#define AHB_DMA_IN_SUC_EOF_CH3_INT_ENA_M  (AHB_DMA_IN_SUC_EOF_CH3_INT_ENA_V << AHB_DMA_IN_SUC_EOF_CH3_INT_ENA_S)
#define AHB_DMA_IN_SUC_EOF_CH3_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_SUC_EOF_CH3_INT_ENA_S  1
/** AHB_DMA_IN_ERR_EOF_CH3_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_ERR_EOF_CH3_INT.
 */
#define AHB_DMA_IN_ERR_EOF_CH3_INT_ENA    (BIT(2))
#define AHB_DMA_IN_ERR_EOF_CH3_INT_ENA_M  (AHB_DMA_IN_ERR_EOF_CH3_INT_ENA_V << AHB_DMA_IN_ERR_EOF_CH3_INT_ENA_S)
#define AHB_DMA_IN_ERR_EOF_CH3_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_ERR_EOF_CH3_INT_ENA_S  2
/** AHB_DMA_IN_DSCR_ERR_CH3_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_DSCR_ERR_CH3_INT.
 */
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_ENA    (BIT(3))
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_ENA_M  (AHB_DMA_IN_DSCR_ERR_CH3_INT_ENA_V << AHB_DMA_IN_DSCR_ERR_CH3_INT_ENA_S)
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_DSCR_ERR_CH3_INT_ENA_S  3
/** AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_DSCR_EMPTY_CH3_INT.
 */
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ENA    (BIT(4))
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_M  (AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_V << AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_S)
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_DSCR_EMPTY_CH3_INT_ENA_S  4
/** AHB_DMA_INFIFO_OVF_CH3_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to enable AHB_DMA_INFIFO_OVF_CH3_INT.
 */
#define AHB_DMA_INFIFO_OVF_CH3_INT_ENA    (BIT(5))
#define AHB_DMA_INFIFO_OVF_CH3_INT_ENA_M  (AHB_DMA_INFIFO_OVF_CH3_INT_ENA_V << AHB_DMA_INFIFO_OVF_CH3_INT_ENA_S)
#define AHB_DMA_INFIFO_OVF_CH3_INT_ENA_V  0x00000001U
#define AHB_DMA_INFIFO_OVF_CH3_INT_ENA_S  5
/** AHB_DMA_INFIFO_UDF_CH3_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Write 1 to enable AHB_DMA_INFIFO_UDF_CH3_INT.
 */
#define AHB_DMA_INFIFO_UDF_CH3_INT_ENA    (BIT(6))
#define AHB_DMA_INFIFO_UDF_CH3_INT_ENA_M  (AHB_DMA_INFIFO_UDF_CH3_INT_ENA_V << AHB_DMA_INFIFO_UDF_CH3_INT_ENA_S)
#define AHB_DMA_INFIFO_UDF_CH3_INT_ENA_V  0x00000001U
#define AHB_DMA_INFIFO_UDF_CH3_INT_ENA_S  6
/** AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  Write 1 to enable AHB_DMA_IN_RESP_ERR_CH3_INT.
 */
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ENA    (BIT(7))
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ENA_M  (AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ENA_V << AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ENA_S)
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ENA_V  0x00000001U
#define AHB_DMA_IN_AHBINF_RESP_ERR_CH3_INT_ENA_S  7

