espressif/esp-idf/components/soc/esp32s31/register/soc/ahb_dma_reg.h
/** AHB_DMA_TX_CH_ARB_WEIGH_CH1_REG register
 *  TX channel 1 arbitration weight configuration register
 */
#define AHB_DMA_TX_CH_ARB_WEIGH_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2bc)
/** AHB_DMA_TX_CH_ARB_WEIGH_CH1 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel1
 */
#define AHB_DMA_TX_CH_ARB_WEIGH_CH1    0x0000000FU
#define AHB_DMA_TX_CH_ARB_WEIGH_CH1_M  (AHB_DMA_TX_CH_ARB_WEIGH_CH1_V << AHB_DMA_TX_CH_ARB_WEIGH_CH1_S)
#define AHB_DMA_TX_CH_ARB_WEIGH_CH1_V  0x0000000FU
#define AHB_DMA_TX_CH_ARB_WEIGH_CH1_S  0

/** AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_REG register
 *  TX channel 1 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_REG (DR_REG_AHB_DMA_BASE + 0x2c0)
/** AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_M  (AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_V << AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_S)
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH1_S  0

/** AHB_DMA_IN_CONF0_CH2_REG register
 *  Configuration register 0 of RX channel 2
 */
#define AHB_DMA_IN_CONF0_CH2_REG (DR_REG_AHB_DMA_BASE + 0x300)
/** AHB_DMA_IN_RST_CH2 : R/W; bitpos: [0]; default: 0;
 *  Write 1 and then 0 to reset AHB_DMA channel 0 RX FSM and RX FIFO pointer.
 */
#define AHB_DMA_IN_RST_CH2    (BIT(0))
#define AHB_DMA_IN_RST_CH2_M  (AHB_DMA_IN_RST_CH2_V << AHB_DMA_IN_RST_CH2_S)
#define AHB_DMA_IN_RST_CH2_V  0x00000001U
#define AHB_DMA_IN_RST_CH2_S  0
/** AHB_DMA_IN_LOOP_TEST_CH2 : R/W; bitpos: [1]; default: 0;
 *  Reserved.
 */
#define AHB_DMA_IN_LOOP_TEST_CH2    (BIT(1))
#define AHB_DMA_IN_LOOP_TEST_CH2_M  (AHB_DMA_IN_LOOP_TEST_CH2_V << AHB_DMA_IN_LOOP_TEST_CH2_S)
#define AHB_DMA_IN_LOOP_TEST_CH2_V  0x00000001U
#define AHB_DMA_IN_LOOP_TEST_CH2_S  1
/** AHB_DMA_INDSCR_BURST_EN_CH2 : R/W; bitpos: [2]; default: 0;
 *  Configures whether to enable INCR burst transfer for RX channel 2 to read
 *  descriptors.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_INDSCR_BURST_EN_CH2    (BIT(2))
#define AHB_DMA_INDSCR_BURST_EN_CH2_M  (AHB_DMA_INDSCR_BURST_EN_CH2_V << AHB_DMA_INDSCR_BURST_EN_CH2_S)
#define AHB_DMA_INDSCR_BURST_EN_CH2_V  0x00000001U
#define AHB_DMA_INDSCR_BURST_EN_CH2_S  2
/** AHB_DMA_MEM_TRANS_EN_CH2 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable memory-to-memory data transfer.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_MEM_TRANS_EN_CH2    (BIT(4))
#define AHB_DMA_MEM_TRANS_EN_CH2_M  (AHB_DMA_MEM_TRANS_EN_CH2_V << AHB_DMA_MEM_TRANS_EN_CH2_S)
#define AHB_DMA_MEM_TRANS_EN_CH2_V  0x00000001U
#define AHB_DMA_MEM_TRANS_EN_CH2_S  4
/** AHB_DMA_IN_ETM_EN_CH2 : R/W; bitpos: [5]; default: 0;
 *  Configures whether to enable ETM control for RX channel2.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_IN_ETM_EN_CH2    (BIT(5))
#define AHB_DMA_IN_ETM_EN_CH2_M  (AHB_DMA_IN_ETM_EN_CH2_V << AHB_DMA_IN_ETM_EN_CH2_S)
#define AHB_DMA_IN_ETM_EN_CH2_V  0x00000001U
#define AHB_DMA_IN_ETM_EN_CH2_S  5
/** AHB_DMA_IN_DATA_BURST_MODE_SEL_CH2 : R/W; bitpos: [7:6]; default: 0;
 *  Configures max burst size for Rx channel2.
 *  2'b00: single
 *  2'b01: incr4
 *  2'b10: incr8
 *  2'b11: incr16
 */
#define AHB_DMA_IN_DATA_BURST_MODE_SEL_CH2    0x00000003U
#define AHB_DMA_IN_DATA_BURST_MODE_SEL_CH2_M  (AHB_DMA_IN_DATA_BURST_MODE_SEL_CH2_V << AHB_DMA_IN_DATA_BURST_MODE_SEL_CH2_S)
#define AHB_DMA_IN_DATA_BURST_MODE_SEL_CH2_V  0x00000003U
#define AHB_DMA_IN_DATA_BURST_MODE_SEL_CH2_S  6

/** AHB_DMA_IN_CONF1_CH2_REG register
 *  Configuration register 1 of RX channel 2
 */
#define AHB_DMA_IN_CONF1_CH2_REG (DR_REG_AHB_DMA_BASE + 0x304)
/** AHB_DMA_IN_CHECK_OWNER_CH2 : R/W; bitpos: [12]; default: 0;
 *  Configures whether to enable owner bit check for RX channel 2.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_IN_CHECK_OWNER_CH2    (BIT(12))
#define AHB_DMA_IN_CHECK_OWNER_CH2_M  (AHB_DMA_IN_CHECK_OWNER_CH2_V << AHB_DMA_IN_CHECK_OWNER_CH2_S)
#define AHB_DMA_IN_CHECK_OWNER_CH2_V  0x00000001U
#define AHB_DMA_IN_CHECK_OWNER_CH2_S  12

/** AHB_DMA_INFIFO_STATUS_CH2_REG register
 *  Receive FIFO status of RX channel 2
 */
#define AHB_DMA_INFIFO_STATUS_CH2_REG (DR_REG_AHB_DMA_BASE + 0x308)
/** AHB_DMA_INFIFO_FULL_CH2 : RO; bitpos: [0]; default: 1;
 *  Represents whether L1 RX FIFO is full.
 *  0: Not Full
 *  1: Full
 */
#define AHB_DMA_INFIFO_FULL_CH2    (BIT(0))
#define AHB_DMA_INFIFO_FULL_CH2_M  (AHB_DMA_INFIFO_FULL_CH2_V << AHB_DMA_INFIFO_FULL_CH2_S)
#define AHB_DMA_INFIFO_FULL_CH2_V  0x00000001U
#define AHB_DMA_INFIFO_FULL_CH2_S  0
/** AHB_DMA_INFIFO_EMPTY_CH2 : RO; bitpos: [1]; default: 1;
 *  Represents whether L1 RX FIFO is empty.
 *  0: Not empty
 *  1: Empty
 */
#define AHB_DMA_INFIFO_EMPTY_CH2    (BIT(1))
#define AHB_DMA_INFIFO_EMPTY_CH2_M  (AHB_DMA_INFIFO_EMPTY_CH2_V << AHB_DMA_INFIFO_EMPTY_CH2_S)
#define AHB_DMA_INFIFO_EMPTY_CH2_V  0x00000001U
#define AHB_DMA_INFIFO_EMPTY_CH2_S  1
/** AHB_DMA_INFIFO_CNT_CH2 : RO; bitpos: [14:8]; default: 0;
 *  Represents the number of data bytes in L1 RX FIFO for RX channel 2.
 */
#define AHB_DMA_INFIFO_CNT_CH2    0x0000007FU
#define AHB_DMA_INFIFO_CNT_CH2_M  (AHB_DMA_INFIFO_CNT_CH2_V << AHB_DMA_INFIFO_CNT_CH2_S)
#define AHB_DMA_INFIFO_CNT_CH2_V  0x0000007FU
#define AHB_DMA_INFIFO_CNT_CH2_S  8
/** AHB_DMA_IN_REMAIN_UNDER_1B_CH2 : RO; bitpos: [23]; default: 1;
 *  reserved
 */
#define AHB_DMA_IN_REMAIN_UNDER_1B_CH2    (BIT(23))
#define AHB_DMA_IN_REMAIN_UNDER_1B_CH2_M  (AHB_DMA_IN_REMAIN_UNDER_1B_CH2_V << AHB_DMA_IN_REMAIN_UNDER_1B_CH2_S)
#define AHB_DMA_IN_REMAIN_UNDER_1B_CH2_V  0x00000001U
#define AHB_DMA_IN_REMAIN_UNDER_1B_CH2_S  23
/** AHB_DMA_IN_REMAIN_UNDER_2B_CH2 : RO; bitpos: [24]; default: 1;
 *  reserved
 */
#define AHB_DMA_IN_REMAIN_UNDER_2B_CH2    (BIT(24))
#define AHB_DMA_IN_REMAIN_UNDER_2B_CH2_M  (AHB_DMA_IN_REMAIN_UNDER_2B_CH2_V << AHB_DMA_IN_REMAIN_UNDER_2B_CH2_S)
#define AHB_DMA_IN_REMAIN_UNDER_2B_CH2_V  0x00000001U
#define AHB_DMA_IN_REMAIN_UNDER_2B_CH2_S  24
/** AHB_DMA_IN_REMAIN_UNDER_3B_CH2 : RO; bitpos: [25]; default: 1;
 *  reserved
 */
#define AHB_DMA_IN_REMAIN_UNDER_3B_CH2    (BIT(25))
#define AHB_DMA_IN_REMAIN_UNDER_3B_CH2_M  (AHB_DMA_IN_REMAIN_UNDER_3B_CH2_V << AHB_DMA_IN_REMAIN_UNDER_3B_CH2_S)
#define AHB_DMA_IN_REMAIN_UNDER_3B_CH2_V  0x00000001U
#define AHB_DMA_IN_REMAIN_UNDER_3B_CH2_S  25
/** AHB_DMA_IN_REMAIN_UNDER_4B_CH2 : RO; bitpos: [26]; default: 1;
 *  reserved
 */
#define AHB_DMA_IN_REMAIN_UNDER_4B_CH2    (BIT(26))
#define AHB_DMA_IN_REMAIN_UNDER_4B_CH2_M  (AHB_DMA_IN_REMAIN_UNDER_4B_CH2_V << AHB_DMA_IN_REMAIN_UNDER_4B_CH2_S)
#define AHB_DMA_IN_REMAIN_UNDER_4B_CH2_V  0x00000001U
#define AHB_DMA_IN_REMAIN_UNDER_4B_CH2_S  26
/** AHB_DMA_IN_BUF_HUNGRY_CH2 : RO; bitpos: [27]; default: 0;
 *  reserved
 */
#define AHB_DMA_IN_BUF_HUNGRY_CH2    (BIT(27))
#define AHB_DMA_IN_BUF_HUNGRY_CH2_M  (AHB_DMA_IN_BUF_HUNGRY_CH2_V << AHB_DMA_IN_BUF_HUNGRY_CH2_S)
#define AHB_DMA_IN_BUF_HUNGRY_CH2_V  0x00000001U
#define AHB_DMA_IN_BUF_HUNGRY_CH2_S  27

/** AHB_DMA_IN_POP_CH2_REG register
 *  Pop control register of RX channel 2
 */
#define AHB_DMA_IN_POP_CH2_REG (DR_REG_AHB_DMA_BASE + 0x30c)
/** AHB_DMA_INFIFO_RDATA_CH2 : RO; bitpos: [11:0]; default: 2048;
 *  Represents the data popped from AHB_DMA FIFO.
 */
#define AHB_DMA_INFIFO_RDATA_CH2    0x00000FFFU
#define AHB_DMA_INFIFO_RDATA_CH2_M  (AHB_DMA_INFIFO_RDATA_CH2_V << AHB_DMA_INFIFO_RDATA_CH2_S)
#define AHB_DMA_INFIFO_RDATA_CH2_V  0x00000FFFU
#define AHB_DMA_INFIFO_RDATA_CH2_S  0
/** AHB_DMA_INFIFO_POP_CH2 : WT; bitpos: [12]; default: 0;
 *  Configures whether to pop data from AHB_DMA FIFO.
 *  0: Invalid. No effect
 *  1: Pop
 */
#define AHB_DMA_INFIFO_POP_CH2    (BIT(12))
#define AHB_DMA_INFIFO_POP_CH2_M  (AHB_DMA_INFIFO_POP_CH2_V << AHB_DMA_INFIFO_POP_CH2_S)
#define AHB_DMA_INFIFO_POP_CH2_V  0x00000001U
#define AHB_DMA_INFIFO_POP_CH2_S  12

/** AHB_DMA_IN_LINK_CH2_REG register
 *  Linked list descriptor configuration and control register of RX channel 2
 */
#define AHB_DMA_IN_LINK_CH2_REG (DR_REG_AHB_DMA_BASE + 0x310)
/** AHB_DMA_INLINK_AUTO_RET_CH2 : R/W; bitpos: [0]; default: 1;
 *  Configures whether to return to current receive descriptor's address when there are
 *  some errors in current receiving data.
 *  0: Not return
 *  1: Return
 */
#define AHB_DMA_INLINK_AUTO_RET_CH2    (BIT(0))
#define AHB_DMA_INLINK_AUTO_RET_CH2_M  (AHB_DMA_INLINK_AUTO_RET_CH2_V << AHB_DMA_INLINK_AUTO_RET_CH2_S)
#define AHB_DMA_INLINK_AUTO_RET_CH2_V  0x00000001U
#define AHB_DMA_INLINK_AUTO_RET_CH2_S  0
/** AHB_DMA_INLINK_STOP_CH2 : WT; bitpos: [1]; default: 0;
 *  Configures whether to stop AHB_DMA's RX channel 2 from receiving data.
 *  0: Invalid. No effect
 *  1: Stop
 */
#define AHB_DMA_INLINK_STOP_CH2    (BIT(1))
#define AHB_DMA_INLINK_STOP_CH2_M  (AHB_DMA_INLINK_STOP_CH2_V << AHB_DMA_INLINK_STOP_CH2_S)
#define AHB_DMA_INLINK_STOP_CH2_V  0x00000001U
#define AHB_DMA_INLINK_STOP_CH2_S  1
/** AHB_DMA_INLINK_START_CH2 : WT; bitpos: [2]; default: 0;
 *  Configures whether to enable AHB_DMA's RX channel 2 for data transfer.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_INLINK_START_CH2    (BIT(2))
#define AHB_DMA_INLINK_START_CH2_M  (AHB_DMA_INLINK_START_CH2_V << AHB_DMA_INLINK_START_CH2_S)
#define AHB_DMA_INLINK_START_CH2_V  0x00000001U
#define AHB_DMA_INLINK_START_CH2_S  2
/** AHB_DMA_INLINK_RESTART_CH2 : WT; bitpos: [3]; default: 0;
 *  Configures whether to restart RX channel 2 for AHB_DMA transfer.
 *  0: Invalid. No effect
 *  1: Restart
 */
#define AHB_DMA_INLINK_RESTART_CH2    (BIT(3))
#define AHB_DMA_INLINK_RESTART_CH2_M  (AHB_DMA_INLINK_RESTART_CH2_V << AHB_DMA_INLINK_RESTART_CH2_S)
#define AHB_DMA_INLINK_RESTART_CH2_V  0x00000001U
#define AHB_DMA_INLINK_RESTART_CH2_S  3
/** AHB_DMA_INLINK_PARK_CH2 : RO; bitpos: [4]; default: 1;
 *  Represents the status of the receive descriptor's FSM.
 *  0: Running
 *  1: Idle
 */
#define AHB_DMA_INLINK_PARK_CH2    (BIT(4))
#define AHB_DMA_INLINK_PARK_CH2_M  (AHB_DMA_INLINK_PARK_CH2_V << AHB_DMA_INLINK_PARK_CH2_S)
#define AHB_DMA_INLINK_PARK_CH2_V  0x00000001U
#define AHB_DMA_INLINK_PARK_CH2_S  4

/** AHB_DMA_IN_LINK_ADDR_CH2_REG register
 *  Link list descriptor address configuration of RX channel 2
 */
#define AHB_DMA_IN_LINK_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x314)
/** AHB_DMA_INLINK_ADDR_CH2 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 32 bits of the first receive descriptor's address.
 */
#define AHB_DMA_INLINK_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_INLINK_ADDR_CH2_M  (AHB_DMA_INLINK_ADDR_CH2_V << AHB_DMA_INLINK_ADDR_CH2_S)
#define AHB_DMA_INLINK_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_ADDR_CH2_S  0

