espressif/esp-idf/components/soc/esp32s31/register/soc/ahb_dma_reg.h
/** AHB_DMA_IN_STATE_CH2_REG register
 *  Receive status of RX channel 2
 */
#define AHB_DMA_IN_STATE_CH2_REG (DR_REG_AHB_DMA_BASE + 0x318)
/** AHB_DMA_INLINK_DSCR_ADDR_CH2 : RO; bitpos: [17:0]; default: 0;
 *  Represents the address of the lower 18 bits of the next receive descriptor to be
 *  processed.
 */
#define AHB_DMA_INLINK_DSCR_ADDR_CH2    0x0003FFFFU
#define AHB_DMA_INLINK_DSCR_ADDR_CH2_M  (AHB_DMA_INLINK_DSCR_ADDR_CH2_V << AHB_DMA_INLINK_DSCR_ADDR_CH2_S)
#define AHB_DMA_INLINK_DSCR_ADDR_CH2_V  0x0003FFFFU
#define AHB_DMA_INLINK_DSCR_ADDR_CH2_S  0
/** AHB_DMA_IN_DSCR_STATE_CH2 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AHB_DMA_IN_DSCR_STATE_CH2    0x00000003U
#define AHB_DMA_IN_DSCR_STATE_CH2_M  (AHB_DMA_IN_DSCR_STATE_CH2_V << AHB_DMA_IN_DSCR_STATE_CH2_S)
#define AHB_DMA_IN_DSCR_STATE_CH2_V  0x00000003U
#define AHB_DMA_IN_DSCR_STATE_CH2_S  18
/** AHB_DMA_IN_STATE_CH2 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AHB_DMA_IN_STATE_CH2    0x00000007U
#define AHB_DMA_IN_STATE_CH2_M  (AHB_DMA_IN_STATE_CH2_V << AHB_DMA_IN_STATE_CH2_S)
#define AHB_DMA_IN_STATE_CH2_V  0x00000007U
#define AHB_DMA_IN_STATE_CH2_S  20

/** AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_REG register
 *  Receive descriptor address when EOF occurs on RX channel 2
 */
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x31c)
/** AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the receive descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_M  (AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_V << AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_S)
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_IN_SUC_EOF_DES_ADDR_CH2_S  0

/** AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_REG register
 *  Receive descriptor address when errors occur of RX channel 2
 */
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x320)
/** AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the receive descriptor when there are some errors in the
 *  currently received data.
 */
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_M  (AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_V << AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_S)
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_IN_ERR_EOF_DES_ADDR_CH2_S  0

/** AHB_DMA_IN_DONE_DES_ADDR_CH2_REG register
 *  RX_done inlink descriptor address of RX channel 2
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x324)
/** AHB_DMA_IN_DONE_DES_ADDR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the inlink descriptor when  this descriptor is completed .
 */
#define AHB_DMA_IN_DONE_DES_ADDR_CH2    0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH2_M  (AHB_DMA_IN_DONE_DES_ADDR_CH2_V << AHB_DMA_IN_DONE_DES_ADDR_CH2_S)
#define AHB_DMA_IN_DONE_DES_ADDR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_IN_DONE_DES_ADDR_CH2_S  0

/** AHB_DMA_IN_DSCR_CH2_REG register
 *  Current receive descriptor address of RX channel 2
 */
#define AHB_DMA_IN_DSCR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x328)
/** AHB_DMA_INLINK_DSCR_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the next receive descriptor x+1 pointed by the current
 *  receive descriptor that has already been fetched.
 */
#define AHB_DMA_INLINK_DSCR_CH2    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_CH2_M  (AHB_DMA_INLINK_DSCR_CH2_V << AHB_DMA_INLINK_DSCR_CH2_S)
#define AHB_DMA_INLINK_DSCR_CH2_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_CH2_S  0

/** AHB_DMA_IN_DSCR_BF0_CH2_REG register
 *  The last receive descriptor address of RX channel 2
 */
#define AHB_DMA_IN_DSCR_BF0_CH2_REG (DR_REG_AHB_DMA_BASE + 0x32c)
/** AHB_DMA_INLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the current receive descriptor x that has already been
 *  fetched.
 */
#define AHB_DMA_INLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF0_CH2_M  (AHB_DMA_INLINK_DSCR_BF0_CH2_V << AHB_DMA_INLINK_DSCR_BF0_CH2_S)
#define AHB_DMA_INLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF0_CH2_S  0

/** AHB_DMA_IN_DSCR_BF1_CH2_REG register
 *  The second-to-last receive descriptor address of RX channel 2
 */
#define AHB_DMA_IN_DSCR_BF1_CH2_REG (DR_REG_AHB_DMA_BASE + 0x330)
/** AHB_DMA_INLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the previous receive descriptor x-1 that has already been
 *  fetched.
 */
#define AHB_DMA_INLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF1_CH2_M  (AHB_DMA_INLINK_DSCR_BF1_CH2_V << AHB_DMA_INLINK_DSCR_BF1_CH2_S)
#define AHB_DMA_INLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define AHB_DMA_INLINK_DSCR_BF1_CH2_S  0

/** AHB_DMA_IN_PRI_CH2_REG register
 *  Priority register of RX channel 2
 */
#define AHB_DMA_IN_PRI_CH2_REG (DR_REG_AHB_DMA_BASE + 0x334)
/** AHB_DMA_RX_PRI_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the priority of RX channel 2.The larger of the value, the higher of the
 *  priority.
 */
#define AHB_DMA_RX_PRI_CH2    0x0000000FU
#define AHB_DMA_RX_PRI_CH2_M  (AHB_DMA_RX_PRI_CH2_V << AHB_DMA_RX_PRI_CH2_S)
#define AHB_DMA_RX_PRI_CH2_V  0x0000000FU
#define AHB_DMA_RX_PRI_CH2_S  0

/** AHB_DMA_IN_PERI_SEL_CH2_REG register
 *  Peripheral selection register of RX channel 2
 */
#define AHB_DMA_IN_PERI_SEL_CH2_REG (DR_REG_AHB_DMA_BASE + 0x338)
/** AHB_DMA_PERI_IN_SEL_CH2 : R/W; bitpos: [5:0]; default: 63;
 *  Configures the peripheral connected to RX channel 2.
 *  0: UHCI0
 *  1: I2S0-0
 *  2: I2S0-1
 *  3: I2S0-2
 *  4: I2S0-3
 *  5: I2S1-0
 *  6: I2S1-1
 *  7: I2S1-2
 *  8: I2S1-3
 *  9: ADC_DAC
 *  10: RMT
 *  11: Sample_rate_convert-0
 *  12: Sample_rate_convert-1
 *  13: Cordic
 *  14: PVT0
 *  15: DUMMY
 */
#define AHB_DMA_PERI_IN_SEL_CH2    0x0000003FU
#define AHB_DMA_PERI_IN_SEL_CH2_M  (AHB_DMA_PERI_IN_SEL_CH2_V << AHB_DMA_PERI_IN_SEL_CH2_S)
#define AHB_DMA_PERI_IN_SEL_CH2_V  0x0000003FU
#define AHB_DMA_PERI_IN_SEL_CH2_S  0

