espressif/esp-idf/components/soc/esp32s31/register/soc/ahb_dma_reg.h
/** AHB_DMA_OUT_DSCR_BF0_CH2_REG register
 *  The last transmit descriptor address of TX channel 2
 */
#define AHB_DMA_OUT_DSCR_BF0_CH2_REG (DR_REG_AHB_DMA_BASE + 0x3ac)
/** AHB_DMA_OUTLINK_DSCR_BF0_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the current transmit descriptor y that has already been
 *  fetched.
 */
#define AHB_DMA_OUTLINK_DSCR_BF0_CH2    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF0_CH2_M  (AHB_DMA_OUTLINK_DSCR_BF0_CH2_V << AHB_DMA_OUTLINK_DSCR_BF0_CH2_S)
#define AHB_DMA_OUTLINK_DSCR_BF0_CH2_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF0_CH2_S  0

/** AHB_DMA_OUT_DSCR_BF1_CH2_REG register
 *  The second-to-last transmit descriptor address of TX channel 2
 */
#define AHB_DMA_OUT_DSCR_BF1_CH2_REG (DR_REG_AHB_DMA_BASE + 0x3b0)
/** AHB_DMA_OUTLINK_DSCR_BF1_CH2 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the previous transmit descriptor y-1 that has already
 *  been fetched.
 */
#define AHB_DMA_OUTLINK_DSCR_BF1_CH2    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF1_CH2_M  (AHB_DMA_OUTLINK_DSCR_BF1_CH2_V << AHB_DMA_OUTLINK_DSCR_BF1_CH2_S)
#define AHB_DMA_OUTLINK_DSCR_BF1_CH2_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF1_CH2_S  0

/** AHB_DMA_OUT_PRI_CH2_REG register
 *  Priority register of TX channel 2
 */
#define AHB_DMA_OUT_PRI_CH2_REG (DR_REG_AHB_DMA_BASE + 0x3b4)
/** AHB_DMA_TX_PRI_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the priority of TX channel 2.The larger of the value, the higher of the
 *  priority.
 */
#define AHB_DMA_TX_PRI_CH2    0x0000000FU
#define AHB_DMA_TX_PRI_CH2_M  (AHB_DMA_TX_PRI_CH2_V << AHB_DMA_TX_PRI_CH2_S)
#define AHB_DMA_TX_PRI_CH2_V  0x0000000FU
#define AHB_DMA_TX_PRI_CH2_S  0

/** AHB_DMA_OUT_PERI_SEL_CH2_REG register
 *  Peripheral selection register of TX channel 2
 */
#define AHB_DMA_OUT_PERI_SEL_CH2_REG (DR_REG_AHB_DMA_BASE + 0x3b8)
/** AHB_DMA_PERI_OUT_SEL_CH2 : R/W; bitpos: [5:0]; default: 63;
 *  Configures the peripheral connected to TX channel 2.
 *  0: UHCI0
 *  1: I2S0-0
 *  2: I2S0-1
 *  3: I2S0-2
 *  4: I2S0-3
 *  5: I2S1-0
 *  6: I2S1-1
 *  7: I2S1-2
 *  8: I2S1-3
 *  9: ADC_DAC
 *  10: RMT
 *  11: Sample_rate_convert-0
 *  12: Sample_rate_convert-1
 *  13: Cordic
 *  14: PVT0
 *  15: DUMMY
 */
#define AHB_DMA_PERI_OUT_SEL_CH2    0x0000003FU
#define AHB_DMA_PERI_OUT_SEL_CH2_M  (AHB_DMA_PERI_OUT_SEL_CH2_V << AHB_DMA_PERI_OUT_SEL_CH2_S)
#define AHB_DMA_PERI_OUT_SEL_CH2_V  0x0000003FU
#define AHB_DMA_PERI_OUT_SEL_CH2_S  0

/** AHB_DMA_TX_CH_ARB_WEIGH_CH2_REG register
 *  TX channel 2 arbitration weight configuration register
 */
#define AHB_DMA_TX_CH_ARB_WEIGH_CH2_REG (DR_REG_AHB_DMA_BASE + 0x3bc)
/** AHB_DMA_TX_CH_ARB_WEIGH_CH2 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel2
 */
#define AHB_DMA_TX_CH_ARB_WEIGH_CH2    0x0000000FU
#define AHB_DMA_TX_CH_ARB_WEIGH_CH2_M  (AHB_DMA_TX_CH_ARB_WEIGH_CH2_V << AHB_DMA_TX_CH_ARB_WEIGH_CH2_S)
#define AHB_DMA_TX_CH_ARB_WEIGH_CH2_V  0x0000000FU
#define AHB_DMA_TX_CH_ARB_WEIGH_CH2_S  0

/** AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_REG register
 *  TX channel 2 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_REG (DR_REG_AHB_DMA_BASE + 0x3c0)
/** AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_M  (AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_V << AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_S)
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH2_S  0

/** AHB_DMA_IN_CONF0_CH3_REG register
 *  Configuration register 0 of RX channel 3
 */
#define AHB_DMA_IN_CONF0_CH3_REG (DR_REG_AHB_DMA_BASE + 0x400)
/** AHB_DMA_IN_RST_CH3 : R/W; bitpos: [0]; default: 0;
 *  Write 1 and then 0 to reset AHB_DMA channel 0 RX FSM and RX FIFO pointer.
 */
#define AHB_DMA_IN_RST_CH3    (BIT(0))
#define AHB_DMA_IN_RST_CH3_M  (AHB_DMA_IN_RST_CH3_V << AHB_DMA_IN_RST_CH3_S)
#define AHB_DMA_IN_RST_CH3_V  0x00000001U
#define AHB_DMA_IN_RST_CH3_S  0
/** AHB_DMA_IN_LOOP_TEST_CH3 : R/W; bitpos: [1]; default: 0;
 *  Reserved.
 */
#define AHB_DMA_IN_LOOP_TEST_CH3    (BIT(1))
#define AHB_DMA_IN_LOOP_TEST_CH3_M  (AHB_DMA_IN_LOOP_TEST_CH3_V << AHB_DMA_IN_LOOP_TEST_CH3_S)
#define AHB_DMA_IN_LOOP_TEST_CH3_V  0x00000001U
#define AHB_DMA_IN_LOOP_TEST_CH3_S  1
/** AHB_DMA_INDSCR_BURST_EN_CH3 : R/W; bitpos: [2]; default: 0;
 *  Configures whether to enable INCR burst transfer for RX channel 3 to read
 *  descriptors.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_INDSCR_BURST_EN_CH3    (BIT(2))
#define AHB_DMA_INDSCR_BURST_EN_CH3_M  (AHB_DMA_INDSCR_BURST_EN_CH3_V << AHB_DMA_INDSCR_BURST_EN_CH3_S)
#define AHB_DMA_INDSCR_BURST_EN_CH3_V  0x00000001U
#define AHB_DMA_INDSCR_BURST_EN_CH3_S  2
/** AHB_DMA_MEM_TRANS_EN_CH3 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable memory-to-memory data transfer.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_MEM_TRANS_EN_CH3    (BIT(4))
#define AHB_DMA_MEM_TRANS_EN_CH3_M  (AHB_DMA_MEM_TRANS_EN_CH3_V << AHB_DMA_MEM_TRANS_EN_CH3_S)
#define AHB_DMA_MEM_TRANS_EN_CH3_V  0x00000001U
#define AHB_DMA_MEM_TRANS_EN_CH3_S  4
/** AHB_DMA_IN_ETM_EN_CH3 : R/W; bitpos: [5]; default: 0;
 *  Configures whether to enable ETM control for RX channel3.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_IN_ETM_EN_CH3    (BIT(5))
#define AHB_DMA_IN_ETM_EN_CH3_M  (AHB_DMA_IN_ETM_EN_CH3_V << AHB_DMA_IN_ETM_EN_CH3_S)
#define AHB_DMA_IN_ETM_EN_CH3_V  0x00000001U
#define AHB_DMA_IN_ETM_EN_CH3_S  5
/** AHB_DMA_IN_DATA_BURST_MODE_SEL_CH3 : R/W; bitpos: [7:6]; default: 0;
 *  Configures max burst size for Rx channel3.
 *  2'b00: single
 *  2'b01: incr4
 *  2'b10: incr8
 *  2'b11: incr16
 */
#define AHB_DMA_IN_DATA_BURST_MODE_SEL_CH3    0x00000003U
#define AHB_DMA_IN_DATA_BURST_MODE_SEL_CH3_M  (AHB_DMA_IN_DATA_BURST_MODE_SEL_CH3_V << AHB_DMA_IN_DATA_BURST_MODE_SEL_CH3_S)
#define AHB_DMA_IN_DATA_BURST_MODE_SEL_CH3_V  0x00000003U
#define AHB_DMA_IN_DATA_BURST_MODE_SEL_CH3_S  6

/** AHB_DMA_IN_CONF1_CH3_REG register
 *  Configuration register 1 of RX channel 3
 */
#define AHB_DMA_IN_CONF1_CH3_REG (DR_REG_AHB_DMA_BASE + 0x404)
/** AHB_DMA_IN_CHECK_OWNER_CH3 : R/W; bitpos: [12]; default: 0;
 *  Configures whether to enable owner bit check for RX channel 3.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_IN_CHECK_OWNER_CH3    (BIT(12))
#define AHB_DMA_IN_CHECK_OWNER_CH3_M  (AHB_DMA_IN_CHECK_OWNER_CH3_V << AHB_DMA_IN_CHECK_OWNER_CH3_S)
#define AHB_DMA_IN_CHECK_OWNER_CH3_V  0x00000001U
#define AHB_DMA_IN_CHECK_OWNER_CH3_S  12

/** AHB_DMA_INFIFO_STATUS_CH3_REG register
 *  Receive FIFO status of RX channel 3
 */
#define AHB_DMA_INFIFO_STATUS_CH3_REG (DR_REG_AHB_DMA_BASE + 0x408)
/** AHB_DMA_INFIFO_FULL_CH3 : RO; bitpos: [0]; default: 1;
 *  Represents whether L1 RX FIFO is full.
 *  0: Not Full
 *  1: Full
 */
#define AHB_DMA_INFIFO_FULL_CH3    (BIT(0))
#define AHB_DMA_INFIFO_FULL_CH3_M  (AHB_DMA_INFIFO_FULL_CH3_V << AHB_DMA_INFIFO_FULL_CH3_S)
#define AHB_DMA_INFIFO_FULL_CH3_V  0x00000001U
#define AHB_DMA_INFIFO_FULL_CH3_S  0
/** AHB_DMA_INFIFO_EMPTY_CH3 : RO; bitpos: [1]; default: 1;
 *  Represents whether L1 RX FIFO is empty.
 *  0: Not empty
 *  1: Empty
 */
#define AHB_DMA_INFIFO_EMPTY_CH3    (BIT(1))
#define AHB_DMA_INFIFO_EMPTY_CH3_M  (AHB_DMA_INFIFO_EMPTY_CH3_V << AHB_DMA_INFIFO_EMPTY_CH3_S)
#define AHB_DMA_INFIFO_EMPTY_CH3_V  0x00000001U
#define AHB_DMA_INFIFO_EMPTY_CH3_S  1
/** AHB_DMA_INFIFO_CNT_CH3 : RO; bitpos: [14:8]; default: 0;
 *  Represents the number of data bytes in L1 RX FIFO for RX channel 3.
 */
#define AHB_DMA_INFIFO_CNT_CH3    0x0000007FU
#define AHB_DMA_INFIFO_CNT_CH3_M  (AHB_DMA_INFIFO_CNT_CH3_V << AHB_DMA_INFIFO_CNT_CH3_S)
#define AHB_DMA_INFIFO_CNT_CH3_V  0x0000007FU
#define AHB_DMA_INFIFO_CNT_CH3_S  8
/** AHB_DMA_IN_REMAIN_UNDER_1B_CH3 : RO; bitpos: [23]; default: 1;
 *  reserved
 */
#define AHB_DMA_IN_REMAIN_UNDER_1B_CH3    (BIT(23))
#define AHB_DMA_IN_REMAIN_UNDER_1B_CH3_M  (AHB_DMA_IN_REMAIN_UNDER_1B_CH3_V << AHB_DMA_IN_REMAIN_UNDER_1B_CH3_S)
#define AHB_DMA_IN_REMAIN_UNDER_1B_CH3_V  0x00000001U
#define AHB_DMA_IN_REMAIN_UNDER_1B_CH3_S  23
/** AHB_DMA_IN_REMAIN_UNDER_2B_CH3 : RO; bitpos: [24]; default: 1;
 *  reserved
 */
#define AHB_DMA_IN_REMAIN_UNDER_2B_CH3    (BIT(24))
#define AHB_DMA_IN_REMAIN_UNDER_2B_CH3_M  (AHB_DMA_IN_REMAIN_UNDER_2B_CH3_V << AHB_DMA_IN_REMAIN_UNDER_2B_CH3_S)
#define AHB_DMA_IN_REMAIN_UNDER_2B_CH3_V  0x00000001U
#define AHB_DMA_IN_REMAIN_UNDER_2B_CH3_S  24
/** AHB_DMA_IN_REMAIN_UNDER_3B_CH3 : RO; bitpos: [25]; default: 1;
 *  reserved
 */
#define AHB_DMA_IN_REMAIN_UNDER_3B_CH3    (BIT(25))
#define AHB_DMA_IN_REMAIN_UNDER_3B_CH3_M  (AHB_DMA_IN_REMAIN_UNDER_3B_CH3_V << AHB_DMA_IN_REMAIN_UNDER_3B_CH3_S)
#define AHB_DMA_IN_REMAIN_UNDER_3B_CH3_V  0x00000001U
#define AHB_DMA_IN_REMAIN_UNDER_3B_CH3_S  25
/** AHB_DMA_IN_REMAIN_UNDER_4B_CH3 : RO; bitpos: [26]; default: 1;
 *  reserved
 */
#define AHB_DMA_IN_REMAIN_UNDER_4B_CH3    (BIT(26))
#define AHB_DMA_IN_REMAIN_UNDER_4B_CH3_M  (AHB_DMA_IN_REMAIN_UNDER_4B_CH3_V << AHB_DMA_IN_REMAIN_UNDER_4B_CH3_S)
#define AHB_DMA_IN_REMAIN_UNDER_4B_CH3_V  0x00000001U
#define AHB_DMA_IN_REMAIN_UNDER_4B_CH3_S  26
/** AHB_DMA_IN_BUF_HUNGRY_CH3 : RO; bitpos: [27]; default: 0;
 *  reserved
 */
#define AHB_DMA_IN_BUF_HUNGRY_CH3    (BIT(27))
#define AHB_DMA_IN_BUF_HUNGRY_CH3_M  (AHB_DMA_IN_BUF_HUNGRY_CH3_V << AHB_DMA_IN_BUF_HUNGRY_CH3_S)
#define AHB_DMA_IN_BUF_HUNGRY_CH3_V  0x00000001U
#define AHB_DMA_IN_BUF_HUNGRY_CH3_S  27

