espressif/esp-idf/components/soc/esp32s31/register/soc/ahb_dma_reg.h
/** AHB_DMA_IN_PRI_CH3_REG register
 *  Priority register of RX channel 3
 */
#define AHB_DMA_IN_PRI_CH3_REG (DR_REG_AHB_DMA_BASE + 0x434)
/** AHB_DMA_RX_PRI_CH3 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the priority of RX channel 3.The larger of the value, the higher of the
 *  priority.
 */
#define AHB_DMA_RX_PRI_CH3    0x0000000FU
#define AHB_DMA_RX_PRI_CH3_M  (AHB_DMA_RX_PRI_CH3_V << AHB_DMA_RX_PRI_CH3_S)
#define AHB_DMA_RX_PRI_CH3_V  0x0000000FU
#define AHB_DMA_RX_PRI_CH3_S  0

/** AHB_DMA_IN_PERI_SEL_CH3_REG register
 *  Peripheral selection register of RX channel 3
 */
#define AHB_DMA_IN_PERI_SEL_CH3_REG (DR_REG_AHB_DMA_BASE + 0x438)
/** AHB_DMA_PERI_IN_SEL_CH3 : R/W; bitpos: [5:0]; default: 63;
 *  Configures the peripheral connected to RX channel 3.
 *  0: UHCI0
 *  1: I2S0-0
 *  2: I2S0-1
 *  3: I2S0-2
 *  4: I2S0-3
 *  5: I2S1-0
 *  6: I2S1-1
 *  7: I2S1-2
 *  8: I2S1-3
 *  9: ADC_DAC
 *  10: RMT
 *  11: Sample_rate_convert-0
 *  12: Sample_rate_convert-1
 *  13: Cordic
 *  14: PVT0
 *  15: DUMMY
 */
#define AHB_DMA_PERI_IN_SEL_CH3    0x0000003FU
#define AHB_DMA_PERI_IN_SEL_CH3_M  (AHB_DMA_PERI_IN_SEL_CH3_V << AHB_DMA_PERI_IN_SEL_CH3_S)
#define AHB_DMA_PERI_IN_SEL_CH3_V  0x0000003FU
#define AHB_DMA_PERI_IN_SEL_CH3_S  0

/** AHB_DMA_RX_CH_ARB_WEIGH_CH3_REG register
 *  RX channel 3 arbitration weight configuration register
 */
#define AHB_DMA_RX_CH_ARB_WEIGH_CH3_REG (DR_REG_AHB_DMA_BASE + 0x43c)
/** AHB_DMA_RX_CH_ARB_WEIGH_CH3 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of RX channel3
 */
#define AHB_DMA_RX_CH_ARB_WEIGH_CH3    0x0000000FU
#define AHB_DMA_RX_CH_ARB_WEIGH_CH3_M  (AHB_DMA_RX_CH_ARB_WEIGH_CH3_V << AHB_DMA_RX_CH_ARB_WEIGH_CH3_S)
#define AHB_DMA_RX_CH_ARB_WEIGH_CH3_V  0x0000000FU
#define AHB_DMA_RX_CH_ARB_WEIGH_CH3_S  0

/** AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3_REG register
 *  RX channel 3 weight arbitration optimization enable register
 */
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3_REG (DR_REG_AHB_DMA_BASE + 0x440)
/** AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3    (BIT(0))
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3_M  (AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3_V << AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3_S)
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3_V  0x00000001U
#define AHB_DMA_RX_ARB_WEIGH_OPT_DIR_CH3_S  0

/** AHB_DMA_OUT_CONF0_CH3_REG register
 *  Configuration register 0 of TX channel 3
 */
#define AHB_DMA_OUT_CONF0_CH3_REG (DR_REG_AHB_DMA_BASE + 0x480)
/** AHB_DMA_OUT_RST_CH3 : R/W; bitpos: [0]; default: 0;
 *  Configures the reset state of AHB_DMA channel 3 TX FSM and TX FIFO pointer.
 *  0: Release reset
 *  1: Reset
 */
#define AHB_DMA_OUT_RST_CH3    (BIT(0))
#define AHB_DMA_OUT_RST_CH3_M  (AHB_DMA_OUT_RST_CH3_V << AHB_DMA_OUT_RST_CH3_S)
#define AHB_DMA_OUT_RST_CH3_V  0x00000001U
#define AHB_DMA_OUT_RST_CH3_S  0
/** AHB_DMA_OUT_LOOP_TEST_CH3 : R/W; bitpos: [1]; default: 0;
 *  Reserved.
 */
#define AHB_DMA_OUT_LOOP_TEST_CH3    (BIT(1))
#define AHB_DMA_OUT_LOOP_TEST_CH3_M  (AHB_DMA_OUT_LOOP_TEST_CH3_V << AHB_DMA_OUT_LOOP_TEST_CH3_S)
#define AHB_DMA_OUT_LOOP_TEST_CH3_V  0x00000001U
#define AHB_DMA_OUT_LOOP_TEST_CH3_S  1
/** AHB_DMA_OUT_AUTO_WRBACK_CH3 : R/W; bitpos: [2]; default: 0;
 *  Configures whether to enable automatic outlink write-back when all the data in TX
 *  FIFO has been transmitted.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_AUTO_WRBACK_CH3    (BIT(2))
#define AHB_DMA_OUT_AUTO_WRBACK_CH3_M  (AHB_DMA_OUT_AUTO_WRBACK_CH3_V << AHB_DMA_OUT_AUTO_WRBACK_CH3_S)
#define AHB_DMA_OUT_AUTO_WRBACK_CH3_V  0x00000001U
#define AHB_DMA_OUT_AUTO_WRBACK_CH3_S  2
/** AHB_DMA_OUT_EOF_MODE_CH3 : R/W; bitpos: [3]; default: 1;
 *  Configures when to generate EOF flag.
 *  0: EOF flag for TX channel 3 is generated when data to be transmitted has been
 *  pushed into FIFO in AHB_DMA.
 *  1: EOF flag for TX channel 3 is generated when data to be transmitted has been
 *  popped from FIFO in AHB_DMA.
 */
#define AHB_DMA_OUT_EOF_MODE_CH3    (BIT(3))
#define AHB_DMA_OUT_EOF_MODE_CH3_M  (AHB_DMA_OUT_EOF_MODE_CH3_V << AHB_DMA_OUT_EOF_MODE_CH3_S)
#define AHB_DMA_OUT_EOF_MODE_CH3_V  0x00000001U
#define AHB_DMA_OUT_EOF_MODE_CH3_S  3
/** AHB_DMA_OUTDSCR_BURST_EN_CH3 : R/W; bitpos: [4]; default: 0;
 *  Configures whether to enable INCR burst transfer for TX channel 3 reading
 *  descriptors.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUTDSCR_BURST_EN_CH3    (BIT(4))
#define AHB_DMA_OUTDSCR_BURST_EN_CH3_M  (AHB_DMA_OUTDSCR_BURST_EN_CH3_V << AHB_DMA_OUTDSCR_BURST_EN_CH3_S)
#define AHB_DMA_OUTDSCR_BURST_EN_CH3_V  0x00000001U
#define AHB_DMA_OUTDSCR_BURST_EN_CH3_S  4
/** AHB_DMA_OUT_ETM_EN_CH3 : R/W; bitpos: [6]; default: 0;
 *  Configures whether to enable ETM control for TX channel 3.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_ETM_EN_CH3    (BIT(6))
#define AHB_DMA_OUT_ETM_EN_CH3_M  (AHB_DMA_OUT_ETM_EN_CH3_V << AHB_DMA_OUT_ETM_EN_CH3_S)
#define AHB_DMA_OUT_ETM_EN_CH3_V  0x00000001U
#define AHB_DMA_OUT_ETM_EN_CH3_S  6
/** AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH3 : R/W; bitpos: [9:8]; default: 0;
 *  Configures max burst size for TX channel3.
 *  2'b00: single
 *  2'b01: incr4
 *  2'b10: incr8
 *  2'b11: incr16
 */
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH3    0x00000003U
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH3_M  (AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH3_V << AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH3_S)
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH3_V  0x00000003U
#define AHB_DMA_OUT_DATA_BURST_MODE_SEL_CH3_S  8

/** AHB_DMA_OUT_CONF1_CH3_REG register
 *  Configuration register 1 of TX channel 3
 */
#define AHB_DMA_OUT_CONF1_CH3_REG (DR_REG_AHB_DMA_BASE + 0x484)
/** AHB_DMA_OUT_CHECK_OWNER_CH3 : R/W; bitpos: [12]; default: 0;
 *  Configures whether to enable owner bit check for TX channel 3.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUT_CHECK_OWNER_CH3    (BIT(12))
#define AHB_DMA_OUT_CHECK_OWNER_CH3_M  (AHB_DMA_OUT_CHECK_OWNER_CH3_V << AHB_DMA_OUT_CHECK_OWNER_CH3_S)
#define AHB_DMA_OUT_CHECK_OWNER_CH3_V  0x00000001U
#define AHB_DMA_OUT_CHECK_OWNER_CH3_S  12

/** AHB_DMA_OUTFIFO_STATUS_CH3_REG register
 *  Transmit FIFO status of TX channel 3
 */
#define AHB_DMA_OUTFIFO_STATUS_CH3_REG (DR_REG_AHB_DMA_BASE + 0x488)
/** AHB_DMA_OUTFIFO_FULL_CH3 : RO; bitpos: [0]; default: 0;
 *  Represents whether L1 TX FIFO is full.
 *  0: Not Full
 *  1: Full
 */
#define AHB_DMA_OUTFIFO_FULL_CH3    (BIT(0))
#define AHB_DMA_OUTFIFO_FULL_CH3_M  (AHB_DMA_OUTFIFO_FULL_CH3_V << AHB_DMA_OUTFIFO_FULL_CH3_S)
#define AHB_DMA_OUTFIFO_FULL_CH3_V  0x00000001U
#define AHB_DMA_OUTFIFO_FULL_CH3_S  0
/** AHB_DMA_OUTFIFO_EMPTY_CH3 : RO; bitpos: [1]; default: 1;
 *  Represents whether L1 TX FIFO is empty.
 *  0: Not empty
 *  1: Empty
 */
#define AHB_DMA_OUTFIFO_EMPTY_CH3    (BIT(1))
#define AHB_DMA_OUTFIFO_EMPTY_CH3_M  (AHB_DMA_OUTFIFO_EMPTY_CH3_V << AHB_DMA_OUTFIFO_EMPTY_CH3_S)
#define AHB_DMA_OUTFIFO_EMPTY_CH3_V  0x00000001U
#define AHB_DMA_OUTFIFO_EMPTY_CH3_S  1
/** AHB_DMA_OUTFIFO_CNT_CH3 : RO; bitpos: [14:8]; default: 0;
 *  Represents the number of data bytes in L1 TX FIFO for TX channel 3.
 */
#define AHB_DMA_OUTFIFO_CNT_CH3    0x0000007FU
#define AHB_DMA_OUTFIFO_CNT_CH3_M  (AHB_DMA_OUTFIFO_CNT_CH3_V << AHB_DMA_OUTFIFO_CNT_CH3_S)
#define AHB_DMA_OUTFIFO_CNT_CH3_V  0x0000007FU
#define AHB_DMA_OUTFIFO_CNT_CH3_S  8
/** AHB_DMA_OUT_REMAIN_UNDER_1B_CH3 : RO; bitpos: [23]; default: 1;
 *  Reserved.
 */
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH3    (BIT(23))
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH3_M  (AHB_DMA_OUT_REMAIN_UNDER_1B_CH3_V << AHB_DMA_OUT_REMAIN_UNDER_1B_CH3_S)
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH3_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_1B_CH3_S  23
/** AHB_DMA_OUT_REMAIN_UNDER_2B_CH3 : RO; bitpos: [24]; default: 1;
 *  Reserved.
 */
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH3    (BIT(24))
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH3_M  (AHB_DMA_OUT_REMAIN_UNDER_2B_CH3_V << AHB_DMA_OUT_REMAIN_UNDER_2B_CH3_S)
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH3_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_2B_CH3_S  24
/** AHB_DMA_OUT_REMAIN_UNDER_3B_CH3 : RO; bitpos: [25]; default: 1;
 *  Reserved.
 */
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH3    (BIT(25))
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH3_M  (AHB_DMA_OUT_REMAIN_UNDER_3B_CH3_V << AHB_DMA_OUT_REMAIN_UNDER_3B_CH3_S)
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH3_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_3B_CH3_S  25
/** AHB_DMA_OUT_REMAIN_UNDER_4B_CH3 : RO; bitpos: [26]; default: 1;
 *  Reserved.
 */
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH3    (BIT(26))
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH3_M  (AHB_DMA_OUT_REMAIN_UNDER_4B_CH3_V << AHB_DMA_OUT_REMAIN_UNDER_4B_CH3_S)
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH3_V  0x00000001U
#define AHB_DMA_OUT_REMAIN_UNDER_4B_CH3_S  26

/** AHB_DMA_OUT_PUSH_CH3_REG register
 *  Push control register of TX channel 3
 */
#define AHB_DMA_OUT_PUSH_CH3_REG (DR_REG_AHB_DMA_BASE + 0x48c)
/** AHB_DMA_OUTFIFO_WDATA_CH3 : R/W; bitpos: [8:0]; default: 0;
 *  Configures the data that need to be pushed into AHB_DMA FIFO.
 */
#define AHB_DMA_OUTFIFO_WDATA_CH3    0x000001FFU
#define AHB_DMA_OUTFIFO_WDATA_CH3_M  (AHB_DMA_OUTFIFO_WDATA_CH3_V << AHB_DMA_OUTFIFO_WDATA_CH3_S)
#define AHB_DMA_OUTFIFO_WDATA_CH3_V  0x000001FFU
#define AHB_DMA_OUTFIFO_WDATA_CH3_S  0
/** AHB_DMA_OUTFIFO_PUSH_CH3 : WT; bitpos: [9]; default: 0;
 *  Configures whether to push data into AHB_DMA FIFO.
 *  0: Invalid. No effect
 *  1: Push
 */
#define AHB_DMA_OUTFIFO_PUSH_CH3    (BIT(9))
#define AHB_DMA_OUTFIFO_PUSH_CH3_M  (AHB_DMA_OUTFIFO_PUSH_CH3_V << AHB_DMA_OUTFIFO_PUSH_CH3_S)
#define AHB_DMA_OUTFIFO_PUSH_CH3_V  0x00000001U
#define AHB_DMA_OUTFIFO_PUSH_CH3_S  9

/** AHB_DMA_OUT_LINK_CH3_REG register
 *  Linked list descriptor configuration and control register of TX channel 3
 */
#define AHB_DMA_OUT_LINK_CH3_REG (DR_REG_AHB_DMA_BASE + 0x490)
/** AHB_DMA_OUTLINK_STOP_CH3 : WT; bitpos: [0]; default: 0;
 *  Configures whether to stop AHB_DMA's TX channel 3 from transmitting data.
 *  0: Invalid. No effect
 *  1: Stop
 */
#define AHB_DMA_OUTLINK_STOP_CH3    (BIT(0))
#define AHB_DMA_OUTLINK_STOP_CH3_M  (AHB_DMA_OUTLINK_STOP_CH3_V << AHB_DMA_OUTLINK_STOP_CH3_S)
#define AHB_DMA_OUTLINK_STOP_CH3_V  0x00000001U
#define AHB_DMA_OUTLINK_STOP_CH3_S  0
/** AHB_DMA_OUTLINK_START_CH3 : WT; bitpos: [1]; default: 0;
 *  Configures whether to enable AHB_DMA's TX channel 3 for data transfer.
 *  0: Disable
 *  1: Enable
 */
#define AHB_DMA_OUTLINK_START_CH3    (BIT(1))
#define AHB_DMA_OUTLINK_START_CH3_M  (AHB_DMA_OUTLINK_START_CH3_V << AHB_DMA_OUTLINK_START_CH3_S)
#define AHB_DMA_OUTLINK_START_CH3_V  0x00000001U
#define AHB_DMA_OUTLINK_START_CH3_S  1
/** AHB_DMA_OUTLINK_RESTART_CH3 : WT; bitpos: [2]; default: 0;
 *  Configures whether to restart TX channel 3 for AHB_DMA transfer.
 *  0: Invalid. No effect
 *  1: Restart
 */
#define AHB_DMA_OUTLINK_RESTART_CH3    (BIT(2))
#define AHB_DMA_OUTLINK_RESTART_CH3_M  (AHB_DMA_OUTLINK_RESTART_CH3_V << AHB_DMA_OUTLINK_RESTART_CH3_S)
#define AHB_DMA_OUTLINK_RESTART_CH3_V  0x00000001U
#define AHB_DMA_OUTLINK_RESTART_CH3_S  2
/** AHB_DMA_OUTLINK_PARK_CH3 : RO; bitpos: [3]; default: 1;
 *  Represents the status of the transmit descriptor's FSM.
 *  0: Running
 *  1: Idle
 */
#define AHB_DMA_OUTLINK_PARK_CH3    (BIT(3))
#define AHB_DMA_OUTLINK_PARK_CH3_M  (AHB_DMA_OUTLINK_PARK_CH3_V << AHB_DMA_OUTLINK_PARK_CH3_S)
#define AHB_DMA_OUTLINK_PARK_CH3_V  0x00000001U
#define AHB_DMA_OUTLINK_PARK_CH3_S  3

/** AHB_DMA_OUT_LINK_ADDR_CH3_REG register
 *  Link list descriptor address configuration of TX channel 3
 */
#define AHB_DMA_OUT_LINK_ADDR_CH3_REG (DR_REG_AHB_DMA_BASE + 0x494)
/** AHB_DMA_OUTLINK_ADDR_CH3 : R/W; bitpos: [31:0]; default: 0;
 *  Configures the 32 bits of the first receive descriptor's address.
 */
#define AHB_DMA_OUTLINK_ADDR_CH3    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_ADDR_CH3_M  (AHB_DMA_OUTLINK_ADDR_CH3_V << AHB_DMA_OUTLINK_ADDR_CH3_S)
#define AHB_DMA_OUTLINK_ADDR_CH3_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_ADDR_CH3_S  0

/** AHB_DMA_OUT_STATE_CH3_REG register
 *  Transmit status of TX channel 3
 */
#define AHB_DMA_OUT_STATE_CH3_REG (DR_REG_AHB_DMA_BASE + 0x498)
/** AHB_DMA_OUTLINK_DSCR_ADDR_CH3 : RO; bitpos: [17:0]; default: 0;
 *  Represents the lower 18 bits of the address of the next transmit descriptor to be
 *  processed.
 */
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH3    0x0003FFFFU
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH3_M  (AHB_DMA_OUTLINK_DSCR_ADDR_CH3_V << AHB_DMA_OUTLINK_DSCR_ADDR_CH3_S)
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH3_V  0x0003FFFFU
#define AHB_DMA_OUTLINK_DSCR_ADDR_CH3_S  0
/** AHB_DMA_OUT_DSCR_STATE_CH3 : RO; bitpos: [19:18]; default: 0;
 *  reserved
 */
#define AHB_DMA_OUT_DSCR_STATE_CH3    0x00000003U
#define AHB_DMA_OUT_DSCR_STATE_CH3_M  (AHB_DMA_OUT_DSCR_STATE_CH3_V << AHB_DMA_OUT_DSCR_STATE_CH3_S)
#define AHB_DMA_OUT_DSCR_STATE_CH3_V  0x00000003U
#define AHB_DMA_OUT_DSCR_STATE_CH3_S  18
/** AHB_DMA_OUT_STATE_CH3 : RO; bitpos: [22:20]; default: 0;
 *  reserved
 */
#define AHB_DMA_OUT_STATE_CH3    0x00000007U
#define AHB_DMA_OUT_STATE_CH3_M  (AHB_DMA_OUT_STATE_CH3_V << AHB_DMA_OUT_STATE_CH3_S)
#define AHB_DMA_OUT_STATE_CH3_V  0x00000007U
#define AHB_DMA_OUT_STATE_CH3_S  20

/** AHB_DMA_OUT_EOF_DES_ADDR_CH3_REG register
 *  Transmit descriptor address when EOF occurs on TX channel 3
 */
#define AHB_DMA_OUT_EOF_DES_ADDR_CH3_REG (DR_REG_AHB_DMA_BASE + 0x49c)
/** AHB_DMA_OUT_EOF_DES_ADDR_CH3 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the transmit descriptor when the EOF bit in this
 *  descriptor is 1.
 */
#define AHB_DMA_OUT_EOF_DES_ADDR_CH3    0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_DES_ADDR_CH3_M  (AHB_DMA_OUT_EOF_DES_ADDR_CH3_V << AHB_DMA_OUT_EOF_DES_ADDR_CH3_S)
#define AHB_DMA_OUT_EOF_DES_ADDR_CH3_V  0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_DES_ADDR_CH3_S  0

