espressif/esp-idf/components/soc/esp32s31/register/soc/ahb_dma_reg.h
/** AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4_REG register
 *  The last transmit descriptor address when EOF occurs on TX channel 4
 */
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5a0)
/** AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the transmit descriptor before the last transmit
 *  descriptor.
 */
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4    0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4_M  (AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4_V << AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4_S)
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4_V  0xFFFFFFFFU
#define AHB_DMA_OUT_EOF_BFR_DES_ADDR_CH4_S  0

/** AHB_DMA_OUT_DONE_DES_ADDR_CH4_REG register
 *  TX done outlink descriptor address of TX channel 4
 */
#define AHB_DMA_OUT_DONE_DES_ADDR_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5a4)
/** AHB_DMA_OUT_DONE_DES_ADDR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the outlink descriptor when this descriptor is completed.
 */
#define AHB_DMA_OUT_DONE_DES_ADDR_CH4    0xFFFFFFFFU
#define AHB_DMA_OUT_DONE_DES_ADDR_CH4_M  (AHB_DMA_OUT_DONE_DES_ADDR_CH4_V << AHB_DMA_OUT_DONE_DES_ADDR_CH4_S)
#define AHB_DMA_OUT_DONE_DES_ADDR_CH4_V  0xFFFFFFFFU
#define AHB_DMA_OUT_DONE_DES_ADDR_CH4_S  0

/** AHB_DMA_OUT_DSCR_CH4_REG register
 *  Current transmit descriptor address of TX channel 4
 */
#define AHB_DMA_OUT_DSCR_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5a8)
/** AHB_DMA_OUTLINK_DSCR_CH4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the next transmit descriptor y+1 pointed by the current
 *  transmit descriptor that has already been fetched.
 */
#define AHB_DMA_OUTLINK_DSCR_CH4    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_CH4_M  (AHB_DMA_OUTLINK_DSCR_CH4_V << AHB_DMA_OUTLINK_DSCR_CH4_S)
#define AHB_DMA_OUTLINK_DSCR_CH4_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_CH4_S  0

/** AHB_DMA_OUT_DSCR_BF0_CH4_REG register
 *  The last transmit descriptor address of TX channel 4
 */
#define AHB_DMA_OUT_DSCR_BF0_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5ac)
/** AHB_DMA_OUTLINK_DSCR_BF0_CH4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the current transmit descriptor y that has already been
 *  fetched.
 */
#define AHB_DMA_OUTLINK_DSCR_BF0_CH4    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF0_CH4_M  (AHB_DMA_OUTLINK_DSCR_BF0_CH4_V << AHB_DMA_OUTLINK_DSCR_BF0_CH4_S)
#define AHB_DMA_OUTLINK_DSCR_BF0_CH4_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF0_CH4_S  0

/** AHB_DMA_OUT_DSCR_BF1_CH4_REG register
 *  The second-to-last transmit descriptor address of TX channel 4
 */
#define AHB_DMA_OUT_DSCR_BF1_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5b0)
/** AHB_DMA_OUTLINK_DSCR_BF1_CH4 : RO; bitpos: [31:0]; default: 0;
 *  Represents the address of the previous transmit descriptor y-1 that has already
 *  been fetched.
 */
#define AHB_DMA_OUTLINK_DSCR_BF1_CH4    0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF1_CH4_M  (AHB_DMA_OUTLINK_DSCR_BF1_CH4_V << AHB_DMA_OUTLINK_DSCR_BF1_CH4_S)
#define AHB_DMA_OUTLINK_DSCR_BF1_CH4_V  0xFFFFFFFFU
#define AHB_DMA_OUTLINK_DSCR_BF1_CH4_S  0

/** AHB_DMA_OUT_PRI_CH4_REG register
 *  Priority register of TX channel 4
 */
#define AHB_DMA_OUT_PRI_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5b4)
/** AHB_DMA_TX_PRI_CH4 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the priority of TX channel 4.The larger of the value, the higher of the
 *  priority.
 */
#define AHB_DMA_TX_PRI_CH4    0x0000000FU
#define AHB_DMA_TX_PRI_CH4_M  (AHB_DMA_TX_PRI_CH4_V << AHB_DMA_TX_PRI_CH4_S)
#define AHB_DMA_TX_PRI_CH4_V  0x0000000FU
#define AHB_DMA_TX_PRI_CH4_S  0

/** AHB_DMA_OUT_PERI_SEL_CH4_REG register
 *  Peripheral selection register of TX channel 4
 */
#define AHB_DMA_OUT_PERI_SEL_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5b8)
/** AHB_DMA_PERI_OUT_SEL_CH4 : R/W; bitpos: [5:0]; default: 63;
 *  Configures the peripheral connected to TX channel 4.
 *  0: UHCI0
 *  1: I2S0-0
 *  2: I2S0-1
 *  3: I2S0-2
 *  4: I2S0-3
 *  5: I2S1-0
 *  6: I2S1-1
 *  7: I2S1-2
 *  8: I2S1-3
 *  9: ADC_DAC
 *  10: RMT
 *  11: Sample_rate_convert-0
 *  12: Sample_rate_convert-1
 *  13: Cordic
 *  14: PVT0
 *  15: DUMMY
 */
#define AHB_DMA_PERI_OUT_SEL_CH4    0x0000003FU
#define AHB_DMA_PERI_OUT_SEL_CH4_M  (AHB_DMA_PERI_OUT_SEL_CH4_V << AHB_DMA_PERI_OUT_SEL_CH4_S)
#define AHB_DMA_PERI_OUT_SEL_CH4_V  0x0000003FU
#define AHB_DMA_PERI_OUT_SEL_CH4_S  0

/** AHB_DMA_TX_CH_ARB_WEIGH_CH4_REG register
 *  TX channel 4 arbitration weight configuration register
 */
#define AHB_DMA_TX_CH_ARB_WEIGH_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5bc)
/** AHB_DMA_TX_CH_ARB_WEIGH_CH4 : R/W; bitpos: [3:0]; default: 0;
 *  Configures the weight(i.e the number of tokens) of TX channel4
 */
#define AHB_DMA_TX_CH_ARB_WEIGH_CH4    0x0000000FU
#define AHB_DMA_TX_CH_ARB_WEIGH_CH4_M  (AHB_DMA_TX_CH_ARB_WEIGH_CH4_V << AHB_DMA_TX_CH_ARB_WEIGH_CH4_S)
#define AHB_DMA_TX_CH_ARB_WEIGH_CH4_V  0x0000000FU
#define AHB_DMA_TX_CH_ARB_WEIGH_CH4_S  0

/** AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4_REG register
 *  TX channel 4 weight arbitration optimization enable register
 */
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4_REG (DR_REG_AHB_DMA_BASE + 0x5c0)
/** AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4 : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4    (BIT(0))
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4_M  (AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4_V << AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4_S)
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4_V  0x00000001U
#define AHB_DMA_TX_ARB_WEIGH_OPT_DIR_CH4_S  0

/** AHB_DMA_INTR_MEM_START_ADDR_REG register
 *  Accessible address space start address configuration register
 */
#define AHB_DMA_INTR_MEM_START_ADDR_REG (DR_REG_AHB_DMA_BASE + 0x600)
/** AHB_DMA_ACCESS_INTR_MEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of accessible address space.
 */
#define AHB_DMA_ACCESS_INTR_MEM_START_ADDR    0xFFFFFFFFU
#define AHB_DMA_ACCESS_INTR_MEM_START_ADDR_M  (AHB_DMA_ACCESS_INTR_MEM_START_ADDR_V << AHB_DMA_ACCESS_INTR_MEM_START_ADDR_S)
#define AHB_DMA_ACCESS_INTR_MEM_START_ADDR_V  0xFFFFFFFFU
#define AHB_DMA_ACCESS_INTR_MEM_START_ADDR_S  0

/** AHB_DMA_INTR_MEM_END_ADDR_REG register
 *  Accessible address space end address configuration register
 */
#define AHB_DMA_INTR_MEM_END_ADDR_REG (DR_REG_AHB_DMA_BASE + 0x604)
/** AHB_DMA_ACCESS_INTR_MEM_END_ADDR : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of accessible address space.
 */
#define AHB_DMA_ACCESS_INTR_MEM_END_ADDR    0xFFFFFFFFU
#define AHB_DMA_ACCESS_INTR_MEM_END_ADDR_M  (AHB_DMA_ACCESS_INTR_MEM_END_ADDR_V << AHB_DMA_ACCESS_INTR_MEM_END_ADDR_S)
#define AHB_DMA_ACCESS_INTR_MEM_END_ADDR_V  0xFFFFFFFFU
#define AHB_DMA_ACCESS_INTR_MEM_END_ADDR_S  0

/** AHB_DMA_ARB_TIMEOUT_REG register
 *  TX arbitration timeout configuration register
 */
#define AHB_DMA_ARB_TIMEOUT_REG (DR_REG_AHB_DMA_BASE + 0x608)
/** AHB_DMA_ARB_TIMEOUT : R/W; bitpos: [15:0]; default: 0;
 *  Configures the time slot. Measurement unit: AHB bus clock cycle.
 */
#define AHB_DMA_ARB_TIMEOUT    0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_M  (AHB_DMA_ARB_TIMEOUT_V << AHB_DMA_ARB_TIMEOUT_S)
#define AHB_DMA_ARB_TIMEOUT_V  0x0000FFFFU
#define AHB_DMA_ARB_TIMEOUT_S  0

